# Задание:
# Реализуйте класс Countdown, который можно использовать в цикле for,
# и который будет поочерёдно возвращать значения от заданного числа start до 0.
# Когда 0 достигнуто — итерация должна завершиться.
# Используйте методы __iter__ и __next__ для реализации итератора.
#
# Пример:
# for number in Countdown(3):
#     print(number)
# Вывод:
# 3
# 2
# 1
# 0

class Countdown:
    pass
